In [1]:
# pandas -> panel data

In [2]:
import pandas as pd
import numpy as np

se = pd.Series([1, 2, np.nan, 4])
se

0    1.0
1    2.0
2    NaN
3    4.0
dtype: float64

In [4]:
data = [1, 2, np.nan, 4]
indexed_se = pd.Series(data, index=["a", "b", "c", "d"])

print(indexed_se)

indexed_se["a"], indexed_se["b"]

a    1.0
b    2.0
c    NaN
d    4.0
dtype: float64

(1.0, 2.0)

In [14]:
income = {"1월": 9500, "2월": 6200, "3월": 6050, "4월": 7000}
income_se = pd.Series(income)

print("낙원동 상점 수익")
print(income_se)

낙원동 상점 수익
1월    9500
2월    6200
3월    6050
4월    7000
dtype: int64

In [ ]:
mine = pd.Series([10, 20, 30], index=["korean,", "english", "math"])
friend = pd.Series([70, 50, 50], index=["korean,", "english", "math"])

merge = mine + friend
print(merge)

korean,    80
english    70
math       80
dtype: int64

In [ ]:
mine = pd.Series([10, 20, 30], index=["naver", "sk", "kt"])
friend = pd.Series([10, 50, 100], index=["kt", "naver", "sk"])

merge = mine + friend  # index가 달라도 같은 것을 찾아서 연산
print(merge)

kt        40
naver     60
sk       120
dtype: int64

In [ ]:
import numpy as np
import pandas as pd

nparray1 = np.array(([1, 2, 3], [4, 5, 6]))

display(pd.DataFrame(nparray1))

dictionary1 = {"a": ["1", "3"], "b": ["1", "2"], "c": ["2", "4"]}

display(pd.DataFrame(dictionary1))

   0  1  2
0  1  2  3
1  4  5  6

   a  b  c
0  1  1  2
1  3  2  4

In [26]:
import pandas as pd

daeshin = {
    "open": [11650, 11100, 11200, 11100, 11000],
    "high": [12100, 11800, 11200, 11100, 11150],
    "low": [11600, 11050, 10900, 10950, 10900],
    "close": [11900, 11600, 11000, 11100, 11050],
}

date = ["16.02.29", "16.02.26", "16.02.25", "16.02.24", "16.02.23"]
daeshin_day = pd.DataFrame(daeshin, index=date)

display(daeshin_day)

print(daeshin_day.columns)
print(daeshin_day.index)

           open   high    low  close
16.02.29  11650  12100  11600  11900
16.02.26  11100  11800  11050  11600
16.02.25  11200  11200  10900  11000
16.02.24  11100  11100  10950  11100
16.02.23  11000  11150  10900  11050

Index(['open', 'high', 'low', 'close'], dtype='object')
Index(['16.02.29', '16.02.26', '16.02.25', '16.02.24', '16.02.23'], dtype='object')

In [29]:
day_data = daeshin_day.loc["16.02.24"]
print(day_data)
print(type(day_data))

open     11100
high     11100
low      10950
close    11100
Name: 16.02.24, dtype: int64
<class 'pandas.core.series.Series'>

In [32]:
dataframe1 = pd.DataFrame(data=[4, 5, 6, 7], index=range(0, 4), columns=["A"])

display(dataframe1)

   A
0  4
1  5
2  6
3  7

In [66]:
import numpy as np
import pandas as pd

df = pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]), columns=[10, 11, 12])

display(df)

   10  11  12
0   1   2   3
1   4   5   6
2   7   8   9

In [42]:
len(df)  # df의 data 개수 (index(행) 기준)

3

In [40]:
df.columns

Index([10, 11, 12], dtype='int64')

In [67]:
df.columns = ["A", "B", "C"]

display(df)

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [44]:
df["A"]

0    1
1    4
2    7
Name: A, dtype: int32

In [46]:
df[["A", "B"]]

   A  B
0  1  2
1  4  5
2  7  8

In [ ]:
df["B"][0:2]  # 0, 1행의 B열 데이터

0    2
1    5
Name: B, dtype: int32

In [ ]:
df.iloc[0]  # 0행의 모든 데이터

A    1
B    2
C    3
Name: 0, dtype: int32

In [ ]:
df.iloc[0:2]  # 0, 1행의 모든 데이터

   A  B  C
0  1  2  3
1  4  5  6

In [ ]:
df.loc[0:2]  # 0, 1, 2행의 모든 데이터 (loc는 끝점 포함, iloc는 미포함)

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [80]:
df = pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]))

display(df)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [81]:
df.loc[3] = [10, 11, 12]  # 3행 추가

display(df)

    0   1   2
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12

In [82]:
df = pd.concat([df, pd.DataFrame([[10, 11, 12]])], ignore_index=True)  # 3행 추가

display(df)

    0   1   2
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12
4  10  11  12

In [83]:
df.columns = ["A", "B", "C"]

In [84]:
df["D"] = list("ddddd")

display(df)

    A   B   C  D
0   1   2   3  d
1   4   5   6  d
2   7   8   9  d
3  10  11  12  d
4  10  11  12  d

In [85]:
df[4] = [4] * 5

display(df)

    A   B   C  D  4
0   1   2   3  d  4
1   4   5   6  d  4
2   7   8   9  d  4
3  10  11  12  d  4
4  10  11  12  d  4

In [86]:
df[7] = [7] * 5

display(df)

    A   B   C  D  4  7
0   1   2   3  d  4  7
1   4   5   6  d  4  7
2   7   8   9  d  4  7
3  10  11  12  d  4  7
4  10  11  12  d  4  7

In [87]:
df = df.drop(7, axis=1)  # 7열 삭제

display(df)

    A   B   C  D  4
0   1   2   3  d  4
1   4   5   6  d  4
2   7   8   9  d  4
3  10  11  12  d  4
4  10  11  12  d  4

In [88]:
df = df.drop([4, "D"], axis=1)  # 4열, D열 삭제

display(df)

    A   B   C
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12
4  10  11  12

In [ ]:
df = df.drop(4, axis=0)  # 4행 삭제

display(df)

    A   B   C
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12

In [90]:
df = df.drop([2, 3], axis=0)  # 2행, 3행 삭제

display(df)

   A  B  C
0  1  2  3
1  4  5  6

In [ ]:
df.loc[0, "A"] = 100  # 0행 A열 데이터 수정

display(df)

     A  B  C
0  100  2  3
1    4  5  6

In [98]:
df.loc[0, "B"] = 100

display(df)

     A    B  C
0  100  100  3
1    4    5  6

In [104]:
df.iloc[1, 1] = 100

display(df)

     A    B  C
0  100  100  3
1    4  100  6

In [106]:
df.iloc[1, 2] = 100

display(df)

     A    B    C
0  100  100    3
1    4  100  100

In [108]:
df.iloc[0, 0:2] = [1, 2]  # 0행 A열, B열 데이터 수정

display(df)

   A    B    C
0  1    2    3
1  4  100  100

In [109]:
df["C"] = [3, 6]

display(df)

   A    B  C
0  1    2  3
1  4  100  6

In [ ]:
df = pd.DataFrame(
    {
        "cluster": [1, 1, 2, 1, 2, 3],
        "org": ["a", "a", "h", "c", "d", "w"],
        "time": [8, 6, 34, 23, 74, 6],
    }
)

display(df)

   cluster org  time
0        1   a     8
1        1   a     6
2        2   h    34
3        1   c    23
4        2   d    74
5        3   w     6

In [ ]:
df = df.sort_values(["time"], ascending=[False])  # time 열 기준으로 내림차순 정렬

display(df)

   cluster org  time
4        2   d    74
2        2   h    34
3        1   c    23
0        1   a     8
1        1   a     6
5        3   w     6

In [ ]:
df = df.reset_index(drop=True)  # index 초기화

display(df)

   cluster org  time
0        2   d    74
1        2   h    34
2        1   c    23
3        1   a     8
4        1   a     6
5        3   w     6

In [114]:
df.describe()  # 통계량 확인

        cluster       time
count  6.000000   6.000000
mean   1.666667  25.166667
std    0.816497  26.445542
min    1.000000   6.000000
25%    1.000000   6.500000
50%    1.500000  15.500000
75%    2.000000  31.250000
max    3.000000  74.000000

In [115]:
df.head(2)  # 상위 2개 행 확인

   cluster org  time
0        2   d    74
1        2   h    34

In [116]:
df.tail(2)  # 하위 2개 행 확인

   cluster org  time
4        1   a     6
5        3   w     6

In [117]:
df.T  # 전치행렬 (행과 열을 바꿈)

          0   1   2  3  4  5
cluster   2   2   1  1  1  3
org       d   h   c  a  a  w
time     74  34  23  8  6  6

In [118]:
df.time  # time 열 확인

0    74
1    34
2    23
3     8
4     6
5     6
Name: time, dtype: int64

In [ ]:
df[df.time < 10]  # time 열이 10보다 작은 행 확인

   cluster org  time
3        1   a     8
4        1   a     6
5        3   w     6